Repository: developerfromjokela/naksu
Catalog: res/gettext/*.po
Languages: fi, sv

source: Filename for Abitti support:
fi: Tiedostonimi Abitti-tuelle:
sv: Filnamn för Abitti-stödet:

source: Wait...
fi: Odota...
sv: Vänta...

source: Copy to clipboard
fi: Kopioi leikepöydälle
sv: Kopiera till urklipp

source: 0 %% (this can take a while...)
fi: 0 %% (tässä voi mennä hetki...)
sv: 0 %% (kan ta ett tag...)

source: Copying logs: %s
fi: Lokitietoja kopioidaan: %s
sv: Kopierar logguppgifter: %s

source: Close
fi: Sulje
sv: Stäng

source: Enter install passphrase for the exam server:
fi: Syötä asennuskoodi Yo-palvelimen asentamiseksi:
sv: Ange installationskoden för att installera examensservern:

source: Cancel
fi: Peruuta
sv: Avbryt

source: Install
fi: Asenna
sv: Installera

source: Start Exam Server
fi: Käynnistä Yo-palvelin
sv: Starta provlokalens server

source: Start %s
fi: Käynnistä %s
sv: Starta %s

source: Update available: %s
fi: Päivitys saatavilla: %s
sv: Uppdatering tillgänglig: %s

source: Abitti Exam
fi: Abitti-koe
sv: Abitti-prov

source: Abitti Exam (%s)
fi: Abitti-koe (%s)
sv: Abitti-prov (%s)

source: Matriculation Exam
fi: Yo-koe
sv: Studentprovet

source: Remove Exams
fi: Poista kokeet
sv: Avlägsna proven

source: Remove Server
fi: Poista palvelin
sv: Avlägsna servern

source: Make Exam Server Backup
fi: Tee palvelimesta varmuuskopio
sv: Säkerhetskopiera servern

source: Send logs to Abitti support
fi: Lähetä lokitiedot Abitti-tukeen
sv: Skicka logguppgifterna till Abitti-stödet

source: Open virtual USB stick (ktp-jako)
fi: Avaa virtuaalinen siirtotikku (ktp-jako)
sv: Öppna den virtuella överföringspinnen (ktp-jako)

source: Network device:
fi: Verkkolaite:
sv: Nätverksenhet:

source: Current version: %s
fi: Asennettu versio: %s
sv: Installerad version: %s

source: Show management features
fi: Näytä hallintaominaisuudet
sv: Visa hanteringsegenskaper

source: Server networking hardware:
fi: Palvelimen verkkolaite:
sv: Servernätverkshårdvara:

source: Install/update server for:
fi: Asenna tai päivitä palvelin:
sv: Installera eller uppdatera server för:

source: DANGER! Annihilate your server:
fi: VAARA! Palvelimen tuhoaminen:
sv: FARA! Utradera servern:

source: naksu: SaveTo
fi: naksu: Tallennuspaikka
sv: naksu: Spara till

source: Please select target path
fi: Valitse tallennuspaikka
sv: Välj sökväg

source: Save
fi: Tallenna
sv: Spara

source: naksu: Send Logs
fi: naksu: Lähetä lokitiedot
sv: naksu: Skicka logguppgifterna

source: naksu: Install Exam Server
fi: naksu: Asenna Yo-palvelin
sv: naksu: Installera studentexamensserver

source: Enter Exam Server install passphrase:
fi: Syötä Yo-palvelimen asennuskoodi:
sv: Ange installationskoden för examensservern:

source: naksu: Remove Exams
fi: naksu: Poista kokeet
sv: naksu: Avlägsna proven

source: Exams, responses and logs in the server will be irreversibly deleted.
fi: Kokeet, suoritukset ja lokitiedot poistetaan peruuttamattomasti.
sv: Alla prov, loggfiler och svar på servern avlägsnas oåterkalleligt.

source: It is recommended to back up your server before removing exams.
fi: On suositeltavaa ottaa palvelimesta varmuuskopio ennen kokeiden poistamista.
sv: Det är rekommenderat att ta en säkerhetskopia av servern före proven avlägsnas.

source: Do you wish to remove all exams?
fi: Haluatko poistaa kaikki kokeet?
sv: Vill du avlägsna alla prov?

source: Yes, Remove
fi: Kyllä, poista
sv: Ja, avlägsna

source: naksu: Remove Server
fi: naksu: Poista palvelin
sv: naksu: Avlägsna servern

source: Removing server destroys it and all downloaded disk images.
fi: Palvelimen poistaminen tuhoaa sen ja kaikki ladatut levynkuvat.
sv: Avlägsnandet av servern utraderar den och alla nedladdade skivavbilder.

source: It is recommended to back up your server before removing server.
fi: On suositeltavaa ottaa palvelimesta varmuuskopio ennen poistamista.
sv: Det är rekommenderat att ta en säkerhetskopia av servern före den avlägsnas.

source: Do you wish to remove the server?
fi: Halutko poistaa palvelimen?
sv: Vill du avlägsna servern?

source: Please select the network device which is connected to your exam network.
fi: Valitse verkkolaite, joka on kytketty koeverkkoon.
sv: Välj den nätverksenhet som är kopplad till examensnätet.

source: You have selected network device '%s' which is not available.
fi: Olet valinnut verkkolaitteen '%s', jota ei löydy.
sv: Du har valt nätverksenheten '%s' men den är inte tillgänglig.

source: You are starting Matriculation Examination server with an Internet connection.
fi: Olet käynnistämässä yo-palvelinta, vaikka palvelimella on internet-yhteys.
sv: Du håller på att starta provlokalsservern för studentexamen, fast servern har internetförbindelse.

source: Please enter install passphrase to install the exam server
fi: Ole hyvä ja syötä asennuskoodi asentaaksesi Yo-palvelimen
sv: Var god ange installationskoden för att installera examensservern

source: Sending logs
fi: Lokitietoja lähetetään
sv: Skickar logguppgifter

source: Sending logs: %d %%
fi: Lokitietoja lähetetään: %d %%
sv: Skickar logguppgifter: %d %%

source: Error sending logs: %s
fi: Virhe lokitietojen lähetyksessä: %s
sv: Fel i skickande av logguppgifter: %s

source: Logs sent!
fi: Lokitiedot lähetetty!
sv: Logguppgifterna har skickats!

source: Cannot send logs because there is no Internet connection. Logs are in a zip archive in the ktp-jako folder.
fi: Lokitietoja ei voi lähettää, koska yhteys Internetiin ei toimi. Lokitiedot löytyvät zip-pakettina ktp-jako -kansiosta.
sv: Logguppgifterna kan inte skickas, eftersom anslutningen till Internet inte fungerar. Logguppgifterna finns sparade som en zip-fil i ktp-jako-mappen.

source: Done copying
fi: Lokitiedot kopioitu
sv: Logguppgifterna är kopierade

source: Zipping logs: %d %%
fi: Lokitietoja pakataan: %d %%
sv: Komprimerar logguppgifter: %d %%

source: Done zipping
fi: Lokitiedot pakattu
sv: Logguppgifterna är komprimerade

source: Error zipping logs: %s
fi: Virhe lokitietojen pakkaamisessa: %s
sv: Fel i komprimering av logguppgifter: %s

source: Backup failed: %v
fi: Varmuuskopiointi epäonnistui: %v
sv: Säkerhetskopieringen misslyckades: %v

source: Backup done: %s
fi: Varmuuskopio valmis: %s
sv: Säkerhetskopian färdig: %s

source: Failed to remove exams: %v
fi: Kokeiden poistaminen epäonnistui: %v
sv: Avlägsnande av proven misslyckades: %v

source: Exams were removed successfully.
fi: Kokeet poistettiin onnistuneesti.
sv: Avlägsnande av proven lyckades.

source: Error while removing server: %v
fi: Palvelimen poistaminen epäonnistui: %v
sv: Avlägsnande av servern misslyckades: %v

source: Server was removed successfully.
fi: Palvelin poistettiin onnistuneesti.
sv: Avlägsnande av server lyckades.

source: Could not execute VBoxManage. Are you sure you have installed Oracle VirtualBox?
fi: Ohjelman VBoxManage käynnistys epäonnistui. Oletko varma, että koneeseen on asennettu Oracle VirtualBox?
sv: Programmet VBoxManage Kunde inte köras. Är du säker, att Oracle VirtualBox har installerats på datorn?

source: Please turn Windows Hypervisor off as it may cause problems.
fi: Ole hyvä ja kytke Windows Hypervisor pois päältä, koska se voi aiheuttaa ongelmia.
sv: Vänligen stäng av Windows Hypervisor eftersom den kan orsaka problem.

source: It appears your CPU does not support hardware virtualisation (VT-x or AMD-V).
fi: Näyttää siltä, että prosessorisi ei tue laitetason virtualisointia (VT-x tai AMD-V).
sv: Det verkar som om din processor inte stöder virtualisering av hårdvara (VT-x eller AMD-V).

source: Hardware virtualisation (VT-x or AMD-V) is disabled. Please enable it before continuing.
fi: Laitetason virtualisointi (VT-x tai AMD-V) on kytketty pois päältä. Kytke se päälle koneen asetuksista.
sv: Virtualiseringen av hårdvaran (VT-x eller AMD-V) är avstängd. Vänligen aktivera den innan du fortsätter.

source: Wireless connection
fi: Langaton yhteys
sv: Trådlös anslutning

source: No network connection
fi: Ei verkkoyhteyttä
sv: Inget nätverk

source: Network speed is too low (%d Mbit/s)
fi: Verkon nopeus ei riitä (%d Mbit/s)
sv: Näthastigheten är för låg (%d Mbit/s)

source: Network status:
fi: Verkon tila:
sv: Nätverksstatus:

source: Removing exams. This takes a while.
fi: Poistetaan kokeita. Tämä vie hetken.
sv: Avlägsnar prov. Detta ta en stund.

source: Cannot open MEB share directory since it does not exist
fi: Hakemiston ktp-jako avaaminen epäonnistui, koska sitä ei ole olemassa
sv: Katalogen ktp-jako kunde inte öppnas eftersom den inte existerar

source: Could not open MEB share directory
fi: Hakemiston ktp-jako avaaminen epäonnistui
sv: Katalogen ktp-jako Kunde inte öppnas

source: Your free disk size is getting low (%s). If backup process fails please consider freeing some disk space.
fi: Levytilasi on käymässä vähiin (%s). Jos varmuuskopio epäonnistui, sinun kannattaa vapauttaa levytilaa.
sv: Skivutrymmet börjar ta slut (%s). Om säkerhetskopieringen misslyckas bör du frigöra mera utrymme.

source: Checking existing file...
fi: Tutkitaan tiedostoa...
sv: Kontrollerar befintlig fil...

source: File %s already exists
fi: Tiedosto %s on jo olemassa
sv: Filen %s existerar redan

source: Checking backup path...
fi: Tutkitaan varmuuskopiohakemistoa...
sv: Kontrollerar katalogen för säkerhetskopia...

source: Could not write test backup file %s. Try another location.
fi: Varmuuskopion kirjoittaminen tiedostoon %s epäonnistui. Kokeile toista tallennuspaikkaa.
sv: Det gick inte att säkerhetskopiera till filen %s. Pröva att spara filen på ett annat ställe.

source: Getting disk location...
fi: Etsitään levyn sijaintia...
sv: Söker efter skivan...

source: Checking for FAT32 filesystem...
fi: Etsitään FAT32-tiedostojärjestelmää...
sv: Söker FAT32-filsystem...

source: The backup file is too large for a FAT32 filesystem. Please reformat the backup disk as exFAT.
fi: Varmuuskopio on liian suuri talletettavaksi FAT32-tiedostojärjestelmäään. Alusta varmuuskopiolevy uudelleen exFAT-tiedostojärjestelmällä.
sv: Säkerhetskopian är för stor för ett FAT32-filsystem. Vänligen formatera minnespinnen eller skivan som exFAT.

source: Please wait, writing backup...
fi: Hetkinen, varmuuskopioidaan...
sv: Var god vänta, säkerhetskopia skrivs...

source: Temporary files
fi: Tilapäishakemisto
sv: Tillfällig katalog

source: Profile directory
fi: Profiilihakemisto
sv: Profilkatalog

source: Desktop
fi: Työpöytä
sv: Skrivbord

source: Home directory
fi: Kotihakemisto
sv: Hemkatalog

source: Could not start server as we could not detect whether existing VM is installed: %v
fi: Palvelinta ei voi käynnistää, koska olemassa olevan palvelimen tutkinta ei onnistu: %v
sv: Servern kunde inte startas eftersom den befintliga servern inte Kunde kontrolleras: %v

source: No server has been installed.
fi: Palvelinta ei ole asennettu.
sv: Ingen server installerad.

source: Could not start server as we could not detect whether existing VM is running: %v
fi: Palvelinta ei voitu käynnistää, koska olemassa olevan palvelin käynnissäoloa ei saatu selville: %v
sv: Servern kunde inte startas eftersom det inte var möjligt att kontrollera ifall befintlig server är på: %v

source: The server is already running.
fi: Palvelin on jo käynnissä.
sv: Servern har redan startats.

source: Could not start VM: %v
fi: Virtuaalikoneen käynnistys epäonnistu: %v
sv: Kunde inte starta den virtuella maskinen: %v

source: Virtual machine was started
fi: Virtuaalikone on käynnistetty
sv: Den virtuella maskinen har startats

source: We could not detect whether existing VM is running: %v, but continued removing the server as you requested.
fi: Nykyisen virtuaalipalvelimen käynnissäoloa ei saatu selville (%v), mutta palvelimen poistamista jatketaan.
sv: Kunde inte bekräfta ifall den befintliga virtuella servern är på: %v men fortsätter avlägsnandet av servern.

source: There is a server appears to be running but we remove it as you requested.
fi: Palvelin on käynnissä, mutta se poistetaan silti.
sv: Servern är på men avlägsnas trots det.

source: Changing current directory to home
fi: Siirryn kotihakemistoon
sv: Går till hemkatalogen

source: Deleting ~/.VirtualBox
fi: Poistetaan ~/.VirtualBox
sv: Raderar ~/.VirtualBox

source: Deleting ~/VirtualBox VMs
fi: Poistetaan ~/VirtualBox VMs
sv: Raderar ~/VirtualBox VMs

source: Failed to remove directory %s: %v
fi: Hakemiston %s poistaminen epäonnistui: %v
sv: Radering av katalogen %s misslyckades: %v

source: Could not get version string for a new server: %v
fi: Uuden palvelin versiotiedon haku epäonnistui: %v
sv: Kunde inte erhålla versionsuppgifterna för ny server: %v

source: Could not create directory: %v
fi: Hakemiston luominen epäonnistui: %v
sv: Det gick inte att skapa katalogen: %v

source: Could not calculate free disk size: %v
fi: Vapaan levytilan määrän laskenta epäonnistui: %v
sv: Beräkning av ledigt skivutrymme misslyckades: %v

source: Getting Image from the Cloud
fi: Lataan levynkuvaa
sv: Laddar skivavbild

source: Failed to get new VM image: %v
fi: Levynkuvan lataaminen epäonnistui: %v
sv: Laddning av skivavbild misslyckades: %v

source: Creating New VM
fi: Uutta virtuaalikonetta luodaan
sv: Skapar en ny virtuell maskin

source: Failed to create new VM: %v
fi: Uuden virtuaalikoneen luominen epäonnistui: %v
sv: Misslyckades med att skapa en ny virtuell maskin: %v

source: Removing temporary raw image file
fi: Väliaikaista levynkuvaa poistetaan
sv: Raderar temporär skivavbild

source: Failed to remove raw image file %s: %v
fi: Levynkuvatiedoston %s poistaminen epäonnistui: %v
sv: Radering av skivavbilden %s misslyckades: %v

source: New VM was created
fi: Uusi virtuaalikone on luotu
sv: En ny virtuell maskin har skapats

source: Could not install server as we could not detect whether existing VM is running: %v
fi: Palvelimen asennus epäonnistui, koska olemassaolevan palvelimen päälläoloa ei saatu tutkittua: %v
sv: Servern kunde inte installeras eftersom det inte gick att kontrollera ifall den befintliga servern är på: %v

source: Please stop the current server before installing a new one
fi: Ole hyvä ja sammuta olemassaoleva palvelin ennen uuden palvelimen asennusta
sv: Var god stäng av den befintliga servern innan en ny server installeras

source: Could not install server as we could not detect whether existing VM is installed: %v
fi: Palvelimen asennus epäonnistui, koska olemassaolevan palvelinasennuksen tutkiminen epäonnistui: %v
sv: Kunde inte installera servern eftersom befintlig server inte kunde bekräftas: %v

source: Could not remove current VM before installing new one: %v
fi: Olemassaolevan palvelimen poistaminen uuden palvelimen alta epäonnistui: %v
sv: Avlägsnande av befintlig server fore installation av ny server misslyckades: %v

source: Creating ~/ktp
fi: Luodaan ~/ktp
sv: Skapar ~/ktp

source: Creating ~/ktp-jako
fi: Luodaan ~/ktp-jako
sv: Skapar ~/ktp-jako

source: Your free disk size is getting low (%s)
fi: Vapaan levytilasi määrä on alhainen (%s)
sv: Det är ont om ledigt skivutrymme (%s)

source: Failed to calculate free disk space: %v
fi: Vapaan levytilan määrän laskenta epäonnistui: %v
sv: Beräkning av ledigt skivutrymme misslyckades: %v

source: Error
fi: Virhe
sv: Fel

source: Warning
fi: Varoitus
sv: Varning

source: Info
fi: Tiedoksi

source: Contacting server
fi: Avataan yhteyttä palvelimelle
sv: Kontaktar servern

source: Opening file
fi: Avataan tiedostoa
sv: Öppnar fil

source: Downloading server image
fi: Ladataan palvelimen levynkuvaa
sv: Laddar skivavbild för servern

source: Downloading image: %d %%
fi: Levynkuvaa ladataan: %d %%

source: Server image downloaded
fi: Palvelimen levynkuva on ladattu
sv: Skivavbild för servern nedladdad

source: Starting to uncompress raw image
fi: Aloitetaan pakatun levynkuvan purkamista
sv: Påbörjar uppackning av den packade skivavbilden

source: Uncompressing image: %d %%
fi: Pakattua levynkuvaa puretaan: %d %%

source: Uncompressing finished
fi: Purkaminen on valmis
sv: Uppackningen klar

source: Naksu encountered an error while trying to fix a problem with VirtualBox. VirtualBox configuration file %s has been moved to %s. Manually rename it to %s to fix this.
fi: VirtualBox-ongelman korjaaminen epäonnistui. VirtualBoxin asetustiedosto %s on nimetty uudelleen (%s). Uudelleen nimeä asetustiedosto käsin nimelle %s korjataksesi ongelman.
sv: Reparation av problemet i VirtualBox misslyckades. Namnet på inställningsfilen %s för VirtualBox har ändrats till %s. Ändra namnet till %s manuellt för att åtgärda problemet.

source: Abitti server
fi: Abitti-palvelin

source: Matric Exam server
fi: Yo-palvelin
sv: Examensserver

source: Naksu has been automatically updated. Please restart Naksu.
fi: Naksu on päivitetty automaattisesti. Ole hyvä ja käynnistä Naksu uudelleen.

source: Naksu has update available, but your version of Naksu has updates disabled. Please update or ask your administrator to update Naksu.
fi: Naksulle on päivitys tarjossa, mutta voimassa oleva asetus estää päivitysten lataamisen. Päivitä tai pyydä koneen ylläpitäjää päivittämään Naksu.

source: Naksu could not check for updates as there is no network connection.
fi: Naksu ei voinut etsiä uusia versioita, koska verkkoyhteys puuttuu.
sv: Naksu kunde inte söka nya uppdateringar för att nätförbindelse saknades.

source: Naksu update failed. Maybe you don't have network connection? Error: %s
fi: Naksun päivitys epäonnistui. Ehkä sinulla ei ole juuri nyt verkkoyhteyttä? Virhe: %s
sv: Uppdateringen av Naksu misslyckades. Du saknar möjligtvis nätförbindelse för tillfället? Fel: %s

source: Remove Exams restores server to its initial status.
sv: Avlägsnande av proven återställer servern till sitt ursprungsläge.
